<template>
  <div class="price">

    <h1>Стоимость услуг</h1>
    <p class="big-text">Мы предоставляем профессиональный расширенный спектр услуг</p>

    <div class="content block-menu">
      <leftMenu :options="blocks" :activeBlock="activeBlock" @clickBlock="clickBlock" />

      <div class="right">
        <div class="section" v-for="section in priceByBlock[activeBlock]" :key="section.block">
          <p class="big-text" v-if="section.block">{{section.block}}</p>
          <div class="line" v-if="section.block"></div>
          <div class="blocks">
            <div class="block" v-for="price in section.blockInfo" :key="price.title">
              <div class="title">
                <p class="text-title">{{price.title}}</p>
                <p class="text-price" :class="price.class">{{price.price}}</p>
              </div>
              <div class="line" v-if="price.text"></div>
              <p class="small-text">{{price.text}}</p>
            </div>
          </div>
        </div>

      </div>
    </div>

  </div>
</template>

<script>
import leftMenu from '@/components/leftMenu'
export default {
  data: () => ({
    activeBlock: 1,
    blocks: [
      { id: 1, title: 'Консультации' },
      { id: 2, title: 'Подготовка документов' },
      { id: 3, title: 'Административное право' },
      { id: 4, title: 'Гражданское право' },
      { id: 5, title: 'Исполнительное право' },
      { id: 6, title: 'Уголовное право' }
    ],
    priceByBlock: {
      1: [
        {
          block: null,
          blockInfo: [
            {
              title: 'Устная консультация',
              text: 'до 3 вопросов, не более 1 часа работы',
              price: 'от 1 500'
            },
            {
              title: 'Письменная консультация',
              text: 'без ознакомления с документами',
              price: 'от 2 500'
            },
            {
              title: 'Письменная консультация',
              text: 'ознакомление с документами',
              price: 'от 4 000'
            },
            {
              title: 'Выезд к клиенту для консультации',
              text: 'г.Москва, ближнее Подмосковье (за час работы)',
              price: 'от 7 000'
            }
          ]
        }
      ],
      2: [
        {
          block: null,
          blockInfo: [
            {
              title: 'Составление запроса, претензий, ответов на претензии',
              price: 'от 3 000'
            },
            {
              title: 'Составление искового заявления, возражений на исковое заявление, апелляционной, кассационной жалобы предусмотренных ГПК РФ',
              price: 'от 5 000'
            },
            {
              title: 'Составление заявление, ходатайств, апелляционной, кассационной жалобы предусмотренных УПК РФ',
              price: 'от 7 000'
            },
            {
              title: 'Составление искового заявления, ходатайств, апелляционной, кассационной жалобы предусмотренных КАС РФ',
              price: 'от 7 000'
            },
            {
              title: 'Адвокатский запрос',
              price: 'от 5 000'
            },
            {
              title: 'Составление проекта мирового соглашения',
              price: 'от 7 000'
            }
          ]
        }
      ],
      3: [
        {
          block: null,
          blockInfo: [
            {
              title: 'Изучение материалов дела, предоставленных клиентом',
              price: 'от 2 000'
            },
            {
              title: 'Ознакомление с материалами дела, снятие копии материалов дела',
              price: 'от 4 000'
            },
            {
              title: 'Представительство в суде 1 инстанции',
              price: 'от 10 000',
              text: 'консультирование, формирование правовой позиции по делу, подготовка необходимых документов, участие в судебном заседании (не более 3 судебных заседаний)'
            },
            {
              title: 'Составление апелляционной жалобы на решение (определение) суда 1 инстанции кассационной жалобы предусмотренных КАС РФ',
              price: 'от 7 000'
            },
            {
              title: 'Участие в судебных заседаниях',
              price: 'от 5 000',
              text: 'в судах апелляционной, кассационной, надзорной инстанции (не более 3 судебных заседаний)'
            },
            {
              title: 'Составление проекта мирового соглашения',
              price: 'от 7 000'
            },
            {
              title: 'Комплексное ведение дела',
              price: 'от 30 000',
              text: 'под ключ'
            }
          ]
        }
      ],
      4: [
        {
          block: null,
          blockInfo: [
            {
              title: 'Изучение материалов дела, предоставленных клиентом',
              price: 'от 3 000'
            },
            {
              title: 'Ознакомление с материалами дела, снятие копии материалов дела',
              price: 'от 4 000'
            },
            {
              title: 'Досудебное урегулирование спора (медиация)',
              price: 'от 5 000'
            },
            {
              title: 'Представительство в суде 1 инстанции',
              price: 'от 10 000',
              text: 'консультирование, формирование правовой позиции по делу, подготовка необходимых документов, участие в судебном заседании (не более 3 судебных заседаний)'
            },
            {
              title: 'Участие в судебных заседаниях в судах апелляционной, кассационной, надзорной инстанции',
              price: 'от 15 000',
              text: 'не более 3 судебных заседаний'
            },
            {
              title: 'Составление апелляционной жалобы на решение (определение) суда 1 инстанции кассационной жалобы предусмотренных КАС РФ',
              price: 'от 7 000'
            },
            {
              title: 'Комплексное ведение дела',
              price: 'от 30 000',
              text: 'под ключ'
            }
          ]
        }
      ],
      5: [
        {
          block: null,
          blockInfo: [
            {
              title: 'Предъявление исполнительного документа',
              price: 'от 4 000'
            },
            {
              title: 'Сопровождение исполнительного документа',
              price: 'от 10 000',
              text: 'своевременность возбуждения ИП, контроль действий судебного пристава'
            },
            {
              title: 'Обжалование постановлений, действий (бездействий) должностного лица',
              price: 'от 3 000'
            },
            {
              title: 'Участие в исполнительных действия на стороне взыскателя (арест имущества)',
              price: 'от 7 000'
            },
            {
              title: 'Комплексное ведение дела',
              price: 'от 30 000',
              text: 'под ключ'
            }
          ]
        }
      ],
      6: [
        {
          block: 'Представление интересов потерпевшего',
          blockInfo: [
            {
              title: 'Составление ходатайств, заявлений, жалоб',
              price: 'от 5 000'
            },
            {
              title: 'Разовое участие адвоката/ представителя для защиты интересов потерпевшего',
              price: 'от 5 000'
            },
            {
              title: 'Представление интересов на стадии следствия',
              price: 'от 20 000'
            },
            {
              title: 'Представление интересов в суде первой инстанции',
              price: 'от 20 000'
            },
            {
              title: 'Представление интересов в суде апелляционной инстанции',
              price: 'от 20 000'
            },
            {
              title: 'Комплексное ведение дела',
              price: 'от 30 000',
              text: 'под ключ'
            }
          ]
        },
        {
          block: 'Представление интересов подозреваемого, обвиняемого, подсудимого',
          blockInfo: [
            {
              title: 'Составление ходатайств, заявлений, жалоб',
              price: 'от 5 000'
            },
            {
              title: 'Разовое участие адвоката/ представителя для защиты интересов потерпевшего',
              price: 'от 5 000'
            },
            {
              title: 'Представление интересов на стадии следствия',
              price: 'от 30 000'
            },
            {
              title: 'Представление интересов в суде первой инстанции',
              price: 'от 30 000'
            },
            {
              title: 'Представление интересов в суде апелляционной инстанции',
              price: 'от 30 000'
            },
            {
              title: 'Комплексное ведение дела',
              price: 'от 60 000',
              text: 'под ключ'
            }
          ]
        },
        {
          block: 'Участие адвоката в вопросах связанным с порядком исполнения приговора суда',
          blockInfo: [
            {
              title: 'Условно-досрочное освобождение от отбывания наказания',
              class: 'small-text',
              price: 'по договоренности',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Изменение вида исправительного учреждения, назначенного по приговору суда осужденному к лишению свободы',
              price: 'по договоренности',
              class: 'small-text',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Замена неотбытой части наказания более мягким видом наказания',
              price: 'по договоренности',
              class: 'small-text',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Замена неотбытой части наказания более мягким видом наказания',
              price: 'по договоренности',
              class: 'small-text',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Освобождение от наказания в связи с болезнью осужденного',
              price: 'по договоренности',
              class: 'small-text',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Отмена условного осуждения или о продлении испытательного срока',
              price: 'от 20 000',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Отмена либо о дополнении возложенных на осужденного обязанностей в соответствии со статьей 73 УК РФ',
              price: 'от 20 000',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Отмена частично либо о дополнении установленных осужденному наказания в виде ограничения свободы в соответствии со статьей 53 УК РФ',
              price: 'от 20 000',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            },
            {
              title: 'Освобождение от наказания или о смягчении наказания вследствие издания уголовного закона, имеющего обратную силу',
              price: 'по договоренности',
              class: 'small-text',
              text: 'подготовка ходатайства, истребование документов, участие в судебном заседании'
            }
          ]
        }
      ]
    }
  }),
  methods: {
    clickBlock (blockId) {
      this.activeBlock = blockId
    }
  },
  components: {
    leftMenu
  }
}
</script>

<style lang="scss" scoped>
.price {
  padding: 2rem 3rem;
  h1, .big-text {
    text-align: center;
    color: $darkGray;
    margin-bottom: 1rem;
  }
  .big-text {
    margin-bottom: 2rem;
  }
  .content {
    .section {
      p.big-text {
        text-align: center;
        margin-bottom: 1.5rem;
      }
      .line {
        width: 100%;
        height: 1px;
        background: $lightGray;
        margin-bottom: 2rem;
      }
      .blocks {
        display: flex;
        justify-content: space-between;
        flex-wrap: wrap;
      }
      .block {
        width: 45%;
        min-width: 15rem;
        margin-bottom: 3rem;
        .line {
          margin-bottom: 0.5rem;
        }
        .title {
          display: flex;
          justify-content: space-between;
          align-items: flex-start;
          margin-bottom: 1rem;
          .text-title {
            padding-right: 2rem;
          }
          .text-price {
            text-align: end;
            min-width: 6rem;
          }
        }
        p.small-text {
          color: $gray
        }
      }
    }
  }
}
</style>
